Reports/Лео_КонтрольЗакрытияПремийНепрямымПокупателямАС/Лео_КонтрольЗакрытияПремийНепрямымПокупателямАС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Лео_КонтрольЗакрытияПремийНепрямымПокупателямАС</name>
  <attributes>
    <name>Результат</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

Documents/Лео_РасчетПремииНепрямымКлиентам/Лео_РасчетПремииНепрямымКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_РасчетПремииНепрямымКлиентам</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВзаимозачет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПоставки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Расчет</name>
    <attributes>
      <name>Сеть</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>Товароборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяСуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТорговыеТочки</name>
    <attributes>
      <name>ТорговыеТочки</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Reports/Лео_КонтрольЗакрытияПремийНепрямымПокупателямАС/ObjectModule.bsl
Процедура СформироватьОтчет() Экспорт
	
	ЕстьОшибки = Ложь;
	Если Не ЗначениеЗаполнено(ДатаС) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата начала периода");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаПо) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата окончания периода");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Результат.Очистить();
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьСтрока = Макет.ПолучитьОбласть("Строка");

	
	УстановитьПривилегированныйРежим(Истина); 
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.Контрагент,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.Контрагент.абс_БизнесРегион КАК Регион,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.Контрагент.абс_Территория КАК Территория,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.Контрагент.абс_Отдел КАК Отдел,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Сеть.НаименованиеПолное КАК НазваниеСети,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Премия КАК СуммаСчета,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.НачалоПериода,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.КонецПериода,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.Договор,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.Контрагент.абс_БизнесРегион.абс_Менеджер КАК ОтветственныйТМ
		|ИЗ
		|	Документ.Лео_РасчетПремииНепрямымКлиентам.Расчет КАК Лео_РасчетПремииНепрямымКлиентамРасчет
		|ГДЕ
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.НачалоПериода МЕЖДУ &ДатаС И &ДатаПо
		|	И Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.КонецПериода МЕЖДУ &ДатаС И &ДатаПо";

	Запрос.УстановитьПараметр("ДатаС", ДатаС);
	Запрос.УстановитьПараметр("ДатаПо", КонецДня(ДатаПо));

	РезультатЗапроса = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат.Вывести(ОбластьШапка);



	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ОбластьСтрока.Параметры.ОтчетныйПериод = "" + Формат (ВыборкаДетальныеЗаписи.НачалоПериода,"ДЛФ=D") + "-" + Формат (ВыборкаДетальныеЗаписи.КонецПериода,"ДЛФ=D");
		
		Результат.Вывести(ОбластьСтрока);
	КонецЦикла;	
	
	Результат.ОтображатьЗаголовки = Истина;	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//Результат.ФиксацияСверху = 14;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
